# St7SetBeamSlices

Sets the number of straight line segments used to render curved beam elements.

long St7SetBeamSlices(long uID, long Slices)

Input Parameters

uID

Strand7 model file ID.

Slices

The number of segments along a beam element in the range kMinSlices to kMaxSlices.